Reports/ЛБ_НачисленныеПроцентыПоДоговоруЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_НачисленныеПроцентыПоДоговоруЗайма</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакетДетально</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОборотыПоОперациямЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОборотыПоОперациямЗайма</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Comment>Залоговый билет</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_НачислениеПроцентовДетально.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_НачислениеПроцентовДетально</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроцентныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньКон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентнаяСтавкаБазовая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентнаяСтавкаАкция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеАкцияОтностельное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеАкцияАбсолютное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЛБ_НачисленныеПроцентыПоДоговоруЗайма/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Отчет.Клиент = Параметры.Клиент;		
	КонецЕсли;    
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		Отчет.ЗалоговыйБилет = Параметры.ЗалоговыйБилет;		
	КонецЕсли;      
	Если Параметры.Свойство("Детально") Тогда
		Отчет.Детально = Параметры.Детально;		
		//+МАН 19.02.26 Заявка 3649
		Если Параметры.Детально Тогда
			ЭтаФорма.Заголовок = "Начисленные проценты по договору займа";
		Иначе
			ЭтаФорма.Заголовок = "Отчет о начисленных и оплаченных процентах по договору займа";
		КонецЕсли;
		//-МАН
	КонецЕсли;   
	Если Параметры.Свойство("Дата") Тогда  
		Если Отчет.Детально Тогда
			Отчет.Дата = Параметры.Дата;
		Иначе	
		    Отчет.Дата = ?(Параметры.Дата < ТекущаяДата(), ТекущаяДата(), Параметры.Дата);
		КонецЕсли;	
	Иначе
		Отчет.Дата = ТекущаяДата();
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		ЗаполнитьСписокЗБ(); 
		Если ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) тогда 
			ВыбранноеЗначение = СписокВыбораЗБ.НайтиПоЗначению(Отчет.ЗалоговыйБилет); 
			Если ВыбранноеЗначение <> Неопределено Тогда 
			     НомерЗБ  = СокрЛП(ВыбранноеЗначение.Представление);
			КонецЕсли; 

		КонецЕсли;	
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) Тогда
		//+МАН 19.02.26 Изменил. Заявка 3649
		//Элементы.ГруппаБыстрыеОтборы.Видимость = ложь;  
		//Элементы.Отбор.ЦветФона = WebЦвета.Белый;  
		//-МАН
		ПроверитьПредварительныйРасчет();
		Если Отчет.Детально Тогда
			//+МАН 19.02.26 Изменил. Заявка 3649
			Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
				Элементы.Клиент.Доступность = Ложь;
			Иначе
				Элементы.Клиент.Доступность = Истина;
			КонецЕсли;
			Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
			Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
			//-МАН
		    СформироватьНаСервереДетально();
		Иначе	
			//+МАН 19.02.26 Изменил. Заявка 3649
			Элементы.ГруппаБыстрыеОтборы.Видимость = Ложь;
			Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
				Элементы.Отбор.Видимость = Ложь;
				Элементы.Сформировать.Доступность = Ложь;
			Иначе
				Элементы.Отбор.Видимость = Истина;
				Элементы.Сформировать.Доступность = Истина;
			КонецЕсли;
			Элементы.Отбор.ЦветФона = WebЦвета.Белый;
			//-МАН
		    СформироватьНаСервере();                 
		КонецЕсли;
	Иначе
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
	
	//+МАН 19.02.26 заявка 3649
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Элементы.Детально.Доступность = Ложь;
	Иначе
		Элементы.Детально.Доступность = Истина;
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаСервере
Процедура ПроверитьПредварительныйРасчет()
    ЗапросИзъятие = Новый Запрос;
	ЗапросИзъятие.УстановитьПараметр("Дата", ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата)));      
	ЗапросИзъятие.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет);
	ЗапросИзъятие.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет
	                      |ИЗ
	                      |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	                      |ГДЕ
	                      |	(ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят)
						  //+МАН 28.04.25 Из-за того что условие было объеденено, то запрос выдавал документы не по указанному ЗБ. Итоговый результат всегда был Ложь. Заявка 2641
	                      //Было: |			ИЛИ ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Остановлен)
	                      |			ИЛИ ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Остановлен))
						  //-МАН
	                      |				И ЛБ_СостояниеЗалоговогоБилета.Период <= &Дата
						  //+МАН 28.04.25 Из-за того что условие объеденено, то запрос выдавал документы не по указанному ЗБ. Итоговый результат всегда был Ложь. Заявка 2641
	                      //Было: |				И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗБ)"; 
	                      |				И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗБ"; 
						  //-МАН
	ВыборкаИзътие = ЗапросИзъятие.Выполнить().Выбрать();
	Если ВыборкаИзътие.Следующий() Тогда 
		ПредварительныйРасчет = ложь;
	Иначе
		ПредварительныйРасчет = Истина;
	КонецЕсли; 
КонецПроцедуры	

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) Тогда
		Сообщить("Не выбран залоговый билет!");
		Возврат;
	КонецЕсли;
	
	Если Отчет.Детально Тогда
		СформироватьНаСервереДетально();
	Иначе	
	   СформироватьНаСервере();
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()	
	ДокументРезультат.Очистить(); 
	Дата1 = НачалоДня(Отчет.ЗалоговыйБилет.Дата);
	Дата2 = ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата)); 
	
	Запрос = Новый Запрос;	
			
	Запрос.УстановитьПараметр("Дата1", Дата1); 
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Период КАК Период,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ВидОперации КАК ВидОперации,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаСсудыОборот) КАК СуммаСсуды,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот) КАК СуммаОплаты,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот) КАК СуммаОплатыЗайм
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&Дата1, &Дата2, Регистратор, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Период,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ВидОперации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";   
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.ВидРасчета КАК ВидРасчета,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход) КАК Сумма,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, , ЗалоговыйБилет = &ЗБ) КАК ЛБ_РасчетыСКлиентамиОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.ВидРасчета,
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.Регистратор"; 
	ТаблицаРасчетов = Запрос.Выполнить().Выгрузить();

	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_НачислениеПроцентовДетально.Регистратор КАК Регистратор,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньНач КАК ДеньНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньКон КАК ДеньКон,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаНач КАК ДатаНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаКон КАК ДатаКон,
	                |	ЛБ_НачислениеПроцентовДетально.ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентов КАК СуммаПроцентов,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентовДень КАК СуммаПроцентовДень
	                |ИЗ
	                |	РегистрНакопления.ЛБ_НачислениеПроцентовДетально КАК ЛБ_НачислениеПроцентовДетально
	                |ГДЕ
	                |	ЛБ_НачислениеПроцентовДетально.ЗалоговыйБилет = &ЗБ";
	ТаблицаРасчетовДетально = Запрос.Выполнить().Выгрузить();

	//+Мельников 27.06.24 Заявка 2641
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПричинаПрименения КАК ПричинаПрименения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗБ";
	ТаблицаСостояний = Запрос.Выполнить().Выгрузить();	
	//-Мельников      
	
		
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Статистика_Обращений_По_Клиенту";
	
	Макет 			 = Отчет.РеквизитМакет;
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтог  = Макет.ПолучитьОбласть("Итог"); 
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");  
	ОбластьСтрока1  = Макет.ПолучитьОбласть("Строка1");
	ОбластьИтог  = Макет.ПолучитьОбласть("Итог");
		
	ОбластьШапка.Параметры.НомерЗБ = СокрЛП(Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета); 
	ОбластьШапка.Параметры.Дата1 = Формат(Отчет.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Дата2 = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy"); 
	ДокументРезультат.Вывести(ОбластьШапка); 
	
	НачисленоИтог = 0; 
	ОплатаПроцентыИтог = 0;  
	ОплатаЗаймИтог = 0;
	Для каждого стр Из ТаблицаЗБ Цикл
		//+Мельников 16.05.24 Добавлено условие для НЕ отображения документов отмены и отмененных документов. 
		Если ТипЗнч(стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
			//Если НЕ ?(ЗначениеЗаполнено(стр.Регистратор.ДокументОтмены), Ложь, ?(ЗначениеЗаполнено(стр.Регистратор.ОтмененныйДокумент), Ложь, Истина)) Тогда  
			Если НЕ ?(ЗначениеЗаполнено(ПолучитьДокументОтмены(стр.Регистратор)), Ложь, ?(ЗначениеЗаполнено(стр.Регистратор.ОтмененныйДокумент), Ложь, Истина)) Тогда  
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		//-Мельников
		ОбластьСтрока.Параметры.Дата = Формат(Стр.Период, "ДФ=dd.MM.yyyy");   
		ОбластьСтрока.Параметры.Вид = Строка(Стр.ВидОперации);
		СтруктураР = Новый Структура;
		СтруктураР.Вставить("ВидОперации", Стр.ВидОперации);
		СтруктураР.Вставить("Документ", Стр.Регистратор);
		Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или 
			(Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление И Стр.Регистратор = Отчет.ЗалоговыйБилет) Тогда
			ОбластьСтрока.Параметры.СуммаЗайма = Стр.СуммаСсуды; 
			ОбластьСтрока.Параметры.ОстатокЗайм = Стр.СуммаСсуды;
			ОстатокЗайм = Стр.СуммаСсуды;  
			ОстатокПроценты = 0;
			ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
			ДокументРезультат.Вывести(ОбластьСтрока);
		Иначе	
			//+Мельников 27.06.24 Заявка 2641
			Отбор = Новый Структура;
			Отбор.Вставить("Регистратор", Стр.Регистратор); 
			СтрокиДоп = ТаблицаРасчетовДетально.НайтиСтроки(Отбор);
			
			Если ТаблицаЗБ.Количество() = 1 Тогда
				Если СтрокиДоп.Количество() = 0 Тогда
					ПоследнийРегистратор = Стр.Регистратор;  
					ПоследняяДатаРасчета = ПоследнийРегистратор.Дата;
					
					НачисленоПредварительно = 0;
					Если НачалоДня(ПоследняяДатаРасчета) < НачалоДня(Дата2) ИЛИ НачалоДня(ПоследняяДатаРасчета) = НачалоДня(Отчет.ЗалоговыйБилет.Дата) Тогда   
						СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата2, Отчет.ЗалоговыйБилет);
						Если ПредварительныйРасчет И НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ   
							СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ
							СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
							СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
							СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен) Тогда	 
							СтрС = ТаблицаСостояний.Получить(ТаблицаСостояний.Количество()-1);   
							ТаблицаНачислений = РасчитатьДолгПоПроцентам(Дата2, СтрС.СуммаЗайма, СтрС.ПричинаПрименения, СтрС.ДатаНачалаРасчетаПроцентов); 
							ОбластьСтрока.Параметры.Дата = Формат(Дата2, "ДФ=dd.MM.yyyy");   
							ОбластьСтрока.Параметры.Вид = "Предварительный расчет";
							ОбластьСтрока.Параметры.СтруктураР = "";
							Если НЕ ТаблицаНачислений.Количество() = 0 Тогда  				 				 
								Ном = 0;       
								НачисленоПериод = 0;
								//ОбщаяСумма = 0;
								//Для каждого СтрДоп из ТаблицаНачислений Цикл
								//	ОбщаяСумма = ОбщаяСумма + СтрДоп.СуммаПроцентов;
								//КонецЦикла;
								
								Для каждого СтрДоп из ТаблицаНачислений Цикл
									СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая; 
									Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
										Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
											СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
										ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
											СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
										ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
											СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
										КонецЕсли; 
									КонецЕсли;	
									Если Ном = 0 Тогда     
										ОбластьСтрока.Параметры.СтавкаДень = ставкаП;   
										ОбластьСтрока.Параметры.ДатаНач = СтрДоп.ДатаНач;
										ОбластьСтрока.Параметры.ДатаКон = СтрДоп.ДатаКон;
										ОбластьСтрока.Параметры.Дата = СтрДоп.ДатаКон;
										КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
										ОбластьСтрока.Параметры.КолДней = КолДней;
										ОбластьСтрока.Параметры.СуммаЗайма = "";
										НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
										НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
										ОбластьСтрока.Параметры.НачисленоПериод = НачисленоПериод;
										ОбластьСтрока.Параметры.НачисленоИтог = НачисленоИтог;
										ОбластьСтрока.Параметры.ОстатокПроценты = НачисленоПериод; //ОбщаяСумма;
										ДокументРезультат.Вывести(ОбластьСтрока);
									Иначе	         
										ОбластьСтрока1.Параметры.СтавкаДень = ставкаП;
										ОбластьСтрока1.Параметры.ДатаНач = СтрДоп.ДатаНач;
										ОбластьСтрока1.Параметры.ДатаКон = СтрДоп.ДатаКон;
										ОбластьСтрока1.Параметры.Дата = СтрДоп.ДатаКон;
										КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
										ОбластьСтрока1.Параметры.КолДней = КолДней;  
										ОбластьСтрока1.Параметры.НачисленоПериод = СтрДоп.СуммаПроцентов;
										СтрокаНачисленоПериод = Формат(НачисленоПериод, "ЧЦ=15; ЧДЦ=2; ЧН=0,00"); 
										СтрокаНачислено = Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
										НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
										НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
										ОбластьСтрока1.Параметры.НачисленоПериод = СтрДоп.СуммаПроцентов;
										ОбластьСтрока1.Параметры.НачисленоИтог = НачисленоИтог;
										ОбластьСтрока1.Параметры.ОстатокПроценты = НачисленоПериод;
										ОбластьСтрока1.Параметры.ОстатокЗайм = Стр.СуммаСсуды;
										ДокументРезультат.Вывести(ОбластьСтрока1);
									КонецЕсли;  
									НачисленоПредварительно = НачисленоПредварительно + СтрДоп.СуммаПроцентов;
									Ном = Ном + 1;
								КонецЦикла;
							Иначе	 
								ОбластьСтрока.Параметры.СтавкаДень = Отчет.ЗалоговыйБилет.ПроцентнаяСхема;
								ОбластьСтрока.Параметры.ДатаНач = Дата2;
								ОбластьСтрока.Параметры.ДатаКон = Дата2; 
								ОбластьСтрока.Параметры.КолДней = 0;
								ОбластьСтрока.Параметры.СуммаЗайма = "";
								
								ОбластьСтрока.Параметры.НачисленоПериод = "0,00";
								
								ОбластьСтрока.Параметры.НачисленоИтог = "0,00";
								ДокументРезультат.Вывести(ОбластьСтрока);
							КонецЕсли;	 
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			//-Мельников
			Иначе     
				Отбор = Новый Структура;
				Отбор.Вставить("Регистратор", Стр.Регистратор); 
				СтрокиР = ТаблицаРасчетов.НайтиСтроки(Отбор);  
				ОплатаПроценты = 0;
				ОплатаЗайм = 0;	
				ОстатокПроценты = 0;  
				Для каждого СтрР из СтрокиР Цикл
					Если СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам Тогда
						ОплатаПроценты = СтрР.Сумма;
						ОстатокПроценты = стрР.Остаток;
					ИначеЕсли СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу Тогда
						ОплатаЗайм = СтрР.Сумма;
						ОстатокЗайм = стрР.Остаток;
		            КонецЕсли;
				Конеццикла;      
				ОбластьСтрока.Параметры.СуммаЗайма = 0;
				ОбластьСтрока.Параметры.ОплатаПроценты = ОплатаПроценты;
				ОбластьСтрока.Параметры.ОплатаЗайм = ОплатаЗайм;
				ОбластьСтрока.Параметры.ОплатаВсего = ОплатаПроценты + ОплатаЗайм; 
				ОбластьСтрока.Параметры.ОстатокПроценты = ОстатокПроценты;
				ОбластьСтрока.Параметры.ОстатокЗайм = ОстатокЗайм;
				ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
				
				ОплатаПроцентыИтог = ОплатаПроцентыИтог + ОплатаПроценты;  
		        ОплатаЗаймИтог = ОплатаЗаймИтог + ОплатаЗайм;
				
				//+МАН 29.04.25 Вывод оплаты процентов после изъятия, оставноки. Заявка 2641 
				Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
				    СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Стр.Регистратор, Стр.Регистратор.ПредыдущаяОперация);
				Иначе
					СтруктураРез = неопределено;
				КонецЕсли;	
				//-МАН
				
				СтрокиДоп = ТаблицаРасчетовДетально.НайтиСтроки(Отбор);
				Если НЕ СтрокиДоп.Количество() = 0 Тогда
					Ном = 0;
					Для каждого СтрДоп из СтрокиДоп Цикл
						СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая; 
						Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
							Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
								СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
							ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
								СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
							ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
								СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
						    КонецЕсли; 
						КонецЕсли;	
						Если Ном = 0 Тогда     
							ОбластьСтрока.Параметры.СтавкаДень = ставкаП;   
							ОбластьСтрока.Параметры.ДатаНач = СтрДоп.ДатаНач;
							ОбластьСтрока.Параметры.ДатаКон = СтрДоп.ДатаКон; 
							ОбластьСтрока.Параметры.КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
							ОбластьСтрока.Параметры.НачисленоПериод = СтрДоп.СуммаПроцентов; 
							НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
							ОбластьСтрока.Параметры.НачисленоИтог = НачисленоИтог;
	                        ДокументРезультат.Вывести(ОбластьСтрока);
						Иначе	         
							ОбластьСтрока1.Параметры.СтавкаДень = ставкаП;
			                ОбластьСтрока1.Параметры.ДатаНач = СтрДоп.ДатаНач;
							ОбластьСтрока1.Параметры.ДатаКон = СтрДоп.ДатаКон; 
							ОбластьСтрока1.Параметры.КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
							ОбластьСтрока1.Параметры.НачисленоПериод = СтрДоп.СуммаПроцентов; 
							НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
							ОбластьСтрока1.Параметры.НачисленоИтог = НачисленоИтог; 
							ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
							ДокументРезультат.Вывести(ОбластьСтрока1);
						КонецЕсли;
						Ном = Ном + 1;
					КонецЦикла; 
				//+МАН 29.04.25 Вывод оплаты процентов после изъятия, оставноки. Заявка 2641
				ИначеЕсли НЕ СтруктураРез = неопределено И (СтруктураРез.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят
					ИЛИ СтруктураРез.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен)
					И Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
					
					ОбластьСтрока.Параметры.СтавкаДень = 0;   
					ОбластьСтрока.Параметры.ДатаНач = Дата(1,1,1);
					ОбластьСтрока.Параметры.ДатаКон = Дата(1,1,1); 
					ОбластьСтрока.Параметры.КолДней = 0;
					ОбластьСтрока.Параметры.НачисленоПериод = 0; 
					ОбластьСтрока.Параметры.НачисленоИтог = 0;

					ДокументРезультат.Вывести(ОбластьСтрока);
				//-МАН
				Иначе
					ОбластьСтрока.Параметры.СтавкаДень = 0;   
					ОбластьСтрока.Параметры.ДатаНач = Дата(1,1,1);
					ОбластьСтрока.Параметры.ДатаКон = Дата(1,1,1); 
					ОбластьСтрока.Параметры.КолДней = 0;
					ОбластьСтрока.Параметры.НачисленоПериод = 0; 
					ОбластьСтрока.Параметры.НачисленоИтог = 0;
				КонецЕсли;	
			КонецЕсли;
		//+Мельников 16.05.24 Добавлено условие для НЕ отображения документов отмены и отмененных документов.
		КонецЕсли;
		//-Мельников
	Конеццикла;	
	ОбластьИтог.Параметры.ОплатаПроценты = ОплатаПроцентыИтог;
	ОбластьИтог.Параметры.ОплатаЗайм = ОплатаЗаймИтог;
	ОбластьИтог.Параметры.ОплатаВсего = ОплатаПроцентыИтог + ОплатаЗаймИтог; 
	ДокументРезультат.Вывести(ОбластьИтог);
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюОплатуПроцентов(Дата)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = Отчет.ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = Дата; 
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = Отчет.ЗалоговыйБилет.ПроцентнаяСхема;  
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Функция РасчитатьДолгПоПроцентам(Дата, СуммаЗайма, ПричинаПримененияПроцентнойСхемы, ДатаНачалаРасчета) 
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(Дата); 	    
		   
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Отчет.ЗалоговыйБилет.Дата, Отчет.ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = Отчет.ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Отчет.ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(Отчет.ЗалоговыйБилет); 	
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
			
	Возврат ДокументОбъект.НачислениеПроцентовДетально;
КонецФункции

&НаСервере
Процедура СформироватьНаСервереДетально()	
	ДокументРезультат.Очистить(); 
	Дата1 = НачалоДня(Отчет.ЗалоговыйБилет.Дата);
	Дата2 = ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата));
	ПоследняяДатаРасчета = Дата(1,1,1);
	
	Запрос = Новый Запрос;	
			
	Запрос.УстановитьПараметр("Дата1", Дата1); 
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Период КАК Период,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ВидОперации КАК ВидОперации,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаСсудыОборот) КАК СуммаСсуды,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот) КАК СуммаОплаты,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот) КАК СуммаОплатыЗайм
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&Дата1, &Дата2, Регистратор, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Период,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ВидОперации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";   
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить(); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПричинаПрименения КАК ПричинаПрименения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗБ
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Дата2";
	ТаблицаСостояний = Запрос.Выполнить().Выгрузить(); 

	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_НачислениеПроцентовДетально.Регистратор КАК Регистратор,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньНач КАК ДеньНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньКон КАК ДеньКон,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаНач КАК ДатаНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаКон КАК ДатаКон,
	                |	ЛБ_НачислениеПроцентовДетально.ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентов КАК СуммаПроцентов,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентовДень КАК СуммаПроцентовДень
	                |ИЗ
	                |	РегистрНакопления.ЛБ_НачислениеПроцентовДетально КАК ЛБ_НачислениеПроцентовДетально
	                |ГДЕ
	                |	ЛБ_НачислениеПроцентовДетально.ЗалоговыйБилет = &ЗБ
	                |	И ЛБ_НачислениеПроцентовДетально.Период <= &Дата2";
	ТаблицаРасчетовДетально = Запрос.Выполнить().Выгрузить();

	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Статистика_Обращений_По_Клиенту";
	
	Макет 			 = Отчет.РеквизитМакетДетально;
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаИтог  = Макет.ПолучитьОбласть("СтрокаИтог"); 
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");  
	ОбластьСтрока1  = Макет.ПолучитьОбласть("Строка1");  
	ОбластьИтог  = Макет.ПолучитьОбласть("Итог");   
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал"); 
	ОбластьПодвалРеализован = Макет.ПолучитьОбласть("ПодвалРеализован");
		
	ОбластьШапка.Параметры.НомерЗБ = СокрЛП(Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета); 
	ОбластьШапка.Параметры.Дата1 = Формат(Отчет.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Дата2 = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy"); 
	ДокументРезультат.Вывести(ОбластьШапка); 
	
	НачисленоИтог = 0; 
	Для каждого стр Из ТаблицаЗБ Цикл 
		
		//+Мельников 16.05.24 Добавлено условие для НЕ отображения документов отмены и отмененных документов.
		Если ТипЗнч(стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
			//Если НЕ ?(ЗначениеЗаполнено(стр.Регистратор.ДокументОтмены), Ложь, ?(ЗначениеЗаполнено(стр.Регистратор.ОтмененныйДокумент), Ложь, Истина)) Тогда 
			Если НЕ ?(ЗначениеЗаполнено(ПолучитьДокументОтмены(стр.Регистратор)), Ложь, ?(ЗначениеЗаполнено(стр.Регистратор.ОтмененныйДокумент), Ложь, Истина)) Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		//-Мельников
			Отбор = Новый Структура;
			Отбор.Вставить("Регистратор", Стр.Регистратор); 
			СтрокиДоп = ТаблицаРасчетовДетально.НайтиСтроки(Отбор);
			Если СтрокиДоп.Количество() = 0 Тогда
				ПоследнийРегистратор = Стр.Регистратор;  
				ПоследняяДатаРасчета = ПоследнийРегистратор.Дата;
	            Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Дата = Формат(Стр.Период, "ДЛФ=DT");   
			ОбластьСтрока.Параметры.ВидОперации = Строка(Стр.ВидОперации);
			СтруктураР = Новый Структура;
			СтруктураР.Вставить("ВидОперации", Стр.ВидОперации);
			СтруктураР.Вставить("Документ", Стр.Регистратор); 
			ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
			
			ОтборС = Новый Структура;
			ОтборС.Вставить("Регистратор", ПоследнийРегистратор); 
			СтрокиС = ТаблицаСостояний.НайтиСтроки(ОтборС);  
			Если НЕ СтрокиС.Количество() = 0 Тогда	
			    СтрС = СтрокиС.Получить(0);
				Ном = 0;       
				НачисленоПериод = 0;
				Для каждого СтрДоп из СтрокиДоп Цикл
					СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая; 
					Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
						Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
					    КонецЕсли; 
					КонецЕсли;	
					Если Ном = 0 Тогда     
						ОбластьСтрока.Параметры.СтавкаДень = ставкаП;   
						ОбластьСтрока.Параметры.ДатаНач = СтрДоп.ДатаНач;
						ОбластьСтрока.Параметры.ДатаКон = СтрДоп.ДатаКон; 
						КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
						ОбластьСтрока.Параметры.КолДней = КолДней;
						ОбластьСтрока.Параметры.СуммаЗайма = СтрС.СуммаЗайма;
						ОбластьСтрока.Параметры.НачисленоПроценты = СокрЛП(Формат(СтрС.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * " + СокрЛП(Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3; ЧН=0,00")) + "% * " + Строка(КолДней) + " дн. = " + СокрЛП(Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")); 
						НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
						НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
						ОбластьСтрока.Параметры.НачисленоИтог = НачисленоИтог;
	                    ДокументРезультат.Вывести(ОбластьСтрока);
					Иначе	         
						ОбластьСтрока1.Параметры.СтавкаДень = ставкаП;
		                ОбластьСтрока1.Параметры.ДатаНач = СтрДоп.ДатаНач;
						ОбластьСтрока1.Параметры.ДатаКон = СтрДоп.ДатаКон;   
						КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
						ОбластьСтрока1.Параметры.КолДней = КолДней;  
						ОбластьСтрока1.Параметры.СуммаЗайма = СтрС.СуммаЗайма;
						СтрокаНачисленоПериод = Формат(НачисленоПериод, "ЧЦ=15; ЧДЦ=2; ЧН=0,00"); 
						СтрокаНачислено = Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
						НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
						ОбластьСтрока1.Параметры.НачисленоПроценты = СокрЛП(Формат(СтрС.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * " + СокрЛП(Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3; ЧН=0,00")) + "% * " + Строка(КолДней) + " дн. = " + СокрЛП(Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) 
	                                           + Символы.ПС + СтрокаНачисленоПериод + "+" +  СтрокаНачислено + "=" + Формат(НачисленоПериод, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");					
						НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
						ОбластьСтрока1.Параметры.НачисленоИтог = НачисленоИтог; 
						ОбластьСтрока1.Параметры.СтруктураР = СтруктураР;
						ДокументРезультат.Вывести(ОбластьСтрока1);
					КонецЕсли;
					Ном = Ном + 1;
				КонецЦикла;
				//Если Ном > 1 Тогда 
				//	ОбластьСтрокаИтог.Параметры.ДатаНач = Формат(СтрокиДоп.Получить(0).ДатаНач, "ДФ=dd.MM.yyyy"); 
				//	ОбластьСтрокаИтог.Параметры.ДатаКон = Формат(СтрокиДоп.Получить(СтрокиДоп.Количество()-1).ДатаКон, "ДФ=dd.MM.yyyy");  
				//	ОбластьСтрокаИтог.Параметры.НачисленоПроценты = НачисленоПериод;  
				//	ОбластьСтрокаИтог.Параметры.НачисленоИтог = НачисленоИтог;
				//	ДокументРезультат.Вывести(ОбластьСтрокаИтог);
				//КонецЕсли;	
			КонецЕсли;
			ПоследнийРегистратор = Стр.Регистратор;  
			ПоследняяДатаРасчета = ПоследнийРегистратор.Дата;
		//+Мельников 16.05.24 Добавлено условие для НЕ отображения документов отмены и отмененных документов. 	
		//КонецЕсли;
		//-Мельников
	Конеццикла;	    
	
	//предварительный расчет 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&Дата2, ЗалоговыйБилет = &ЗБ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ЗалоговыйБилет";
	ОстатокЗБ = 0;
	ВыборкаОст = Запрос.Выполнить().Выбрать();
	Если ВыборкаОст.Следующий() Тогда  
		ОстатокЗБ = ВыборкаОст.СуммаОстаток;
	КонецЕсли;	
	НачисленоПредварительно = 0;   
	СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата2, Отчет.ЗалоговыйБилет);
	Если НачалоДня(ПоследняяДатаРасчета) < НачалоДня(Дата2) ИЛИ НачалоДня(ПоследняяДатаРасчета) = НачалоДня(Отчет.ЗалоговыйБилет.Дата) Тогда   		
		Если ПредварительныйРасчет И НЕ ОстатокЗБ = 0 И НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ   
			     СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ 
				 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ ИЛИ
			     СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		         СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ  
				 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован ИЛИ
		         СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен) Тогда	 
			 СтрС = ТаблицаСостояний.Получить(ТаблицаСостояний.Количество()-1);   
			 ТаблицаНачислений = РасчитатьДолгПоПроцентам(Дата2, СтрС.СуммаЗайма, СтрС.ПричинаПрименения, СтрС.ДатаНачалаРасчетаПроцентов); 
			 ОбластьСтрока.Параметры.Дата = Формат(Дата2, "ДФ=dd.MM.yyyy");   
			 ОбластьСтрока.Параметры.ВидОперации = "Предварительный расчет";
			 //ОбластьСтрока.Параметры.СтруктураР = неопределено;
			 Если НЕ ТаблицаНачислений.Количество() = 0 Тогда  				 				 
				 Ном = 0;       
				 НачисленоПериод = 0;
				 Для каждого СтрДоп из ТаблицаНачислений Цикл
					СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая; 
					Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
						Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
					    КонецЕсли; 
					КонецЕсли;	
					Если Ном = 0 Тогда     
						ОбластьСтрока.Параметры.СтавкаДень = ставкаП;   
						ОбластьСтрока.Параметры.ДатаНач = СтрДоп.ДатаНач;
						ОбластьСтрока.Параметры.ДатаКон = СтрДоп.ДатаКон;    
						КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
						ОбластьСтрока.Параметры.КолДней = КолДней;
						ОбластьСтрока.Параметры.СуммаЗайма = СтрС.СуммаЗайма;
						ОбластьСтрока.Параметры.НачисленоПроценты = СокрЛП(Формат(СтрС.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * " + СокрЛП(Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3; ЧН=0,00")) + "% * " + Строка(КолДней) + " дн. = " + СокрЛП(Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")); 
						НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
						НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
						ОбластьСтрока.Параметры.НачисленоИтог = НачисленоИтог;
	                    ДокументРезультат.Вывести(ОбластьСтрока);
					Иначе	         
						ОбластьСтрока1.Параметры.СтавкаДень = ставкаП;
		                ОбластьСтрока1.Параметры.ДатаНач = СтрДоп.ДатаНач;
						ОбластьСтрока1.Параметры.ДатаКон = СтрДоп.ДатаКон;  
						КолДней = (НачалоДня(СтрДоп.ДатаКон) - НачалоДня(СтрДоп.ДатаНач)) / (60 * 60 * 24) + 1;
						ОбластьСтрока1.Параметры.КолДней = КолДней;  
						ОбластьСтрока1.Параметры.СуммаЗайма = СтрС.СуммаЗайма;
						ОбластьСтрока1.Параметры.НачисленоПроценты = СтрДоп.СуммаПроцентов;
						СтрокаНачисленоПериод = Формат(НачисленоПериод, "ЧЦ=15; ЧДЦ=2; ЧН=0,00"); 
					    СтрокаНачислено = Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
					    НачисленоПериод = НачисленоПериод + СтрДоп.СуммаПроцентов;
					    ОбластьСтрока1.Параметры.НачисленоПроценты = СокрЛП(Формат(СтрС.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * " + СокрЛП(Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3; ЧН=0,00")) + "% * " + Строка(КолДней) + " дн. = " + СокрЛП(Формат(СтрДоп.СуммаПроцентов, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + 
						          Символы.ПС + СтрокаНачисленоПериод + " + " +  СтрокаНачислено + " = " + Формат(НачисленоПериод, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");					
						НачисленоИтог = НачисленоИтог + СтрДоп.СуммаПроцентов;
						ОбластьСтрока1.Параметры.НачисленоИтог = НачисленоИтог;
						ДокументРезультат.Вывести(ОбластьСтрока1);
					КонецЕсли;  
					НачисленоПредварительно = НачисленоПредварительно + СтрДоп.СуммаПроцентов;
					Ном = Ном + 1;
				 КонецЦикла;
				 //Если Ном > 1 Тогда 
				 //   ОбластьСтрокаИтог.Параметры.ДатаНач = Формат(ТаблицаНачислений.Получить(0).ДатаНач, "ДФ=dd.MM.yyyy"); 
				 //   ОбластьСтрокаИтог.Параметры.ДатаКон = Формат(ТаблицаНачислений.Получить(СтрокиДоп.Количество()-1).ДатаКон, "ДФ=dd.MM.yyyy");  
				 //   ОбластьСтрокаИтог.Параметры.НачисленоПроценты = НачисленоПериод;  
				 //   ОбластьСтрокаИтог.Параметры.НачисленоИтог = НачисленоИтог;
				 //   ДокументРезультат.Вывести(ОбластьСтрокаИтог);
				 //КонецЕсли;	      
			 Иначе	 
				 //Тест = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Отчет.ЗалоговыйБилет.Дата, Отчет.ЗалоговыйБилет.Организация);
				 //Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(Отчет.ЗалоговыйБилет); 	
				 //Текст = "";
				 
				 //+Мельников 28.05.24 Отображение процентов
				 ОбластьСтрока.Параметры.СтавкаДень = Отчет.ЗалоговыйБилет.ПроцентнаяСхема; //Было: "0,000";  
				 //-Мельников
				 ОбластьСтрока.Параметры.ДатаНач = Дата2;
				 ОбластьСтрока.Параметры.ДатаКон = Дата2; 
				 ОбластьСтрока.Параметры.КолДней = 0;
				 ОбластьСтрока.Параметры.СуммаЗайма = Отчет.ЗалоговыйБилет.СуммаСсуды;
				 
				 //+Мельников 28.05.24 Старое закомментировал. Изменил
				 //ОбластьСтрока.Параметры.НачисленоПроценты = СокрЛП(Формат(Отчет.ЗалоговыйБилет.СуммаСсуды, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * 0,000% * 0 дн. = 0,00"; 
				 ОбластьСтрока.Параметры.НачисленоПроценты = СокрЛП(Формат(Отчет.ЗалоговыйБилет.СуммаСсуды, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " * " + Отчет.ЗалоговыйБилет.ПроцентнаяСхема + " * 0 дн. = 0,00"; 
				 //-Мельников
				 
				 ОбластьСтрока.Параметры.НачисленоИтог = "0,00";
                 ДокументРезультат.Вывести(ОбластьСтрока);
			 КонецЕсли;	 
        КонецЕсли;
	КонецЕсли;	
	
	ДокументРезультат.Вывести(ОбластьИтог);     
	
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован Тогда  
		ДокументРезультат.Вывести(ОбластьПодвалРеализован); 
	Иначе	
		Запрос.УстановитьПараметр("Дата", Дата2);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета КАК ВидРасчета,
		               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Остаток
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(&Дата, ЗалоговыйБилет = &ЗБ) КАК ЛБ_РасчетыСКлиентамиОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета"; 
		ТаблицаРасчетов = Запрос.Выполнить().Выгрузить();    
		ДолгЗайм = 0;
		ДолгПроценты = 0;
		Для каждого СтрР из ТаблицаРасчетов Цикл
			Если СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам Тогда
				ДолгПроценты = ДолгПроценты + стрР.Остаток;
			ИначеЕсли СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу Тогда
				ДолгЗайм = ДолгЗайм + стрР.Остаток;
	        КонецЕсли;
		Конеццикла;      
		
		ОбластьПодвал.Параметры.Дата = Формат(Дата2, "ДФ=dd.MM.yyyy");
		СуммаДолга = ДолгЗайм + ДолгПроценты + НачисленоПредварительно; 
		СуммаДолгаРуб = Цел(СуммаДолга);
		СуммаДолгаКоп = (СуммаДолга - Цел(СуммаДолга))*100;
		ОбластьПодвал.Параметры.СуммаДолгаРуб = Формат(СуммаДолгаРуб, "ЧЦ=15; ЧРГ=' '; ЧН=0");
		ОбластьПодвал.Параметры.СуммаДолгаКоп = Формат(СуммаДолгаКоп, "ЧЦ=2; ЧН=00; ЧВН="); 
		ДолгЗаймРуб = Цел(ДолгЗайм);
		ДолгЗаймКоп = (ДолгЗайм - Цел(ДолгЗайм))*100;
		ОбластьПодвал.Параметры.СуммаЗаймРуб = Формат(ДолгЗаймРуб, "ЧЦ=15; ЧРГ=' '; ЧН=0");
	    ОбластьПодвал.Параметры.СуммаЗаймКоп = Формат(ДолгЗаймКоп, "ЧЦ=2; ЧН=00; ЧВН=");
		НачисленоПредварительно = НачисленоПредварительно + ДолгПроценты;
		СуммаПроцентыРуб = Цел(НачисленоПредварительно);
		СуммаПроцентыКоп = (НачисленоПредварительно - Цел(НачисленоПредварительно))*100;
		ОбластьПодвал.Параметры.СуммаПроцентыРуб = Формат(СуммаПроцентыРуб, "ЧЦ=15; ЧРГ=' '; ЧН=0");
	    ОбластьПодвал.Параметры.СуммаПроцентыКоп = Формат(СуммаПроцентыКоп, "ЧЦ=2; ЧН=00; ЧВН="); 	
		ДолгПроцентыРуб = Цел(ДолгПроценты);
		ДолгПроцентыКоп = (ДолгПроценты - Цел(ДолгПроценты))*100;
		ОбластьПодвал.Параметры.СуммаПроцентыДолгРуб = Формат(ДолгПроцентыРуб, "ЧЦ=15; ЧРГ=' '; ЧН=0");
	    ОбластьПодвал.Параметры.СуммаПроцентыДолгКоп = Формат(ДолгПроцентыКоп, "ЧЦ=2; ЧН=00; ЧВН="); 
	    	
	    ДокументРезультат.Вывести(ОбластьПодвал); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", Отчет.Дата);	
    ПараметрыФормы.Вставить("БезДокументов", истина);
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Отчет.Клиент);
	КонецЕсли;		
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Отчет.Клиент = Результат.Залогодатель;  
	
	ЗаполнитьСписокЗБ();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокЗБ(НомерЗБ = неопределено) 
	СписокВыбораЗБ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(Отчет.Дата));
	Запрос.УстановитьПараметр("Клиент", Отчет.Клиент); 
	СписокВО = Новый списокЗначений;
	СписокВО.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	СписокВО.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление); 
	Запрос.УстановитьПараметр("ВидыОперации", СписокВО); 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета
	              |ИЗ
	              |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(
	              |			,
	              |			&Дата,
	              |			Регистратор,
	              |			Залогодатель = &Клиент
	              |				И ВидОперации В (&ВидыОперации)) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	НомерЗалоговогоБилета";
	Выборка = Запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл  
		Если НЕ НомерЗБ = неопределено Тогда
			Если Найти(Выборка.НомерЗалоговогоБилета, СокрЛП(НомерЗБ)) = 0 Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		СписокВыбораЗБ.Добавить(Выборка.ЗалоговыйБилет, Выборка.НомерЗалоговогоБилета + "            ");
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьНомерЗБ()
	Возврат Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаКлиенте
Процедура Отбор(Команда)
	Если Элементы.ГруппаБыстрыеОтборы.Видимость Тогда 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Ложь;
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
	Иначе 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбораЗБ, Элементы.ЗалоговыйБилет); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	    Отчет.ЗалоговыйБилет = ВыбранноеЗначение.Значение;
	    НомерЗБ  = СокрЛП(ВыбранноеЗначение.Представление);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = ложь;  
		ПараметрыФормы = Новый структура;
		ПараметрыФормы.Вставить("Документ", Расшифровка.Документ);
		Если Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", ПараметрыФормы, ЭтаФорма);
		ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма);
		ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма);
	    ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") Тогда 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетПриИзменении(Элемент)
	НомерЗБ = Элемент.ТекстРедактирования;
	ЗаполнитьСписокЗБ(?(ПустаяСтрока(НомерЗБ), неопределено, НомерЗБ));
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбораЗБ, Элементы.ЗалоговыйБилет); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	    Отчет.ЗалоговыйБилет = ВыбранноеЗначение.Значение;
	    НомерЗБ  = СокрЛП(ВыбранноеЗначение.Представление);  
		ПроверитьПредварительныйРасчет();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДетальноПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) Тогда
		Сообщить("Не выбран залоговый билет!");
		Возврат;
	КонецЕсли;
	
	Если Отчет.Детально Тогда            
		Если НЕ Элементы.ГруппаБыстрыеОтборы.Видимость Тогда 
			Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
			Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
		КонецЕсли;	
		//+МАН 19.02.26 Заявка 3649
		ЭтаФорма.Заголовок = "Начисленные проценты по договору займа";
		//-МАН

		СформироватьНаСервереДетально();
	Иначе	
		//+МАН 19.02.26 Заявка 3649
		ЭтаФорма.Заголовок = "Отчет о начисленных и оплаченных процентах по договору займа";
		//-МАН
	   СформироватьНаСервере();
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
